# DataFrame

In [4]:
import pandas as pd
# import numpy as np
from numpy.random import randn

### 1. Criação de um dataframe

In [105]:
dataframe = pd.DataFrame(randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [106]:
dataframe

          W         X         Y         Z
A  1.984914  1.224551 -1.909883 -0.451053
B  1.464035 -1.318643 -0.685007  0.089285
C  0.897420 -0.163765 -1.690658 -1.519895
D -2.092707 -0.325972  0.541912  1.045758
E  0.076728  0.420728 -0.467139 -0.795635

In [45]:
type(dataframe)

pandas.DataFrame

### 2. Seleção de uma series do dataframe

In [46]:
dataframe["W"]

A   -0.475898
B    0.074939
C    1.344452
D   -1.470935
E   -0.330055
Name: W, dtype: float64

In [47]:
type(dataframe["W"])

pandas.Series

### 3. Seleção de uma series no formato dataframe

In [48]:
dataframe[["W"]]

          W
A -0.475898
B  0.074939
C  1.344452
D -1.470935
E -0.330055

In [49]:
type(dataframe[["W"]])

pandas.DataFrame

### 4. Seleção de uma ou mais series

In [50]:
dataframe[["W", "X"]]

          W         X
A -0.475898  1.169883
B  0.074939  0.455702
C  1.344452  3.159129
D -1.470935 -0.686175
E -0.330055  0.945098

In [51]:
type(dataframe[["W", "X"]])

pandas.DataFrame

### 5. Manipulações no DataFrame

##### 1. Criação de uma coluna que é a cópia de uma já existente

In [52]:
dataframe["new"] = dataframe["W"]

In [53]:
dataframe

          W         X         Y         Z       new
A -0.475898  1.169883 -0.056353  0.356876 -0.475898
B  0.074939  0.455702  0.523786 -0.036872  0.074939
C  1.344452  3.159129 -0.476787  1.948722  1.344452
D -1.470935 -0.686175 -0.115709 -0.393146 -1.470935
E -0.330055  0.945098 -0.983779  1.061418 -0.330055

##### 2. Criação de uma coluna que é a soma de outras duas

In [54]:
dataframe["sum"] = dataframe["W"] + dataframe["X"]

In [55]:
dataframe

          W         X         Y         Z       new       sum
A -0.475898  1.169883 -0.056353  0.356876 -0.475898  0.693985
B  0.074939  0.455702  0.523786 -0.036872  0.074939  0.530641
C  1.344452  3.159129 -0.476787  1.948722  1.344452  4.503581
D -1.470935 -0.686175 -0.115709 -0.393146 -1.470935 -2.157110
E -0.330055  0.945098 -0.983779  1.061418 -0.330055  0.615043

##### 3. Remoção de uma coluna

In [57]:
dataframe.drop("new", axis=1) #axis=1 equivale a colunas | axis=0 equivale a linhas

          W         X         Y         Z       sum
A -0.475898  1.169883 -0.056353  0.356876  0.693985
B  0.074939  0.455702  0.523786 -0.036872  0.530641
C  1.344452  3.159129 -0.476787  1.948722  4.503581
D -1.470935 -0.686175 -0.115709 -0.393146 -2.157110
E -0.330055  0.945098 -0.983779  1.061418  0.615043

##### 4. Cópia ou original?

A maioria, se não todas as funções do pandas não alteram efetivamente o dataset, elas apenas fazem uma cópia do mesmo, permitindo que você trabalhe com os dados modificados e os vizualize, mas o dataset original segue intacto, veja:

In [61]:
dataframe

          W         X         Y         Z       new       sum
A -0.475898  1.169883 -0.056353  0.356876 -0.475898  0.693985
B  0.074939  0.455702  0.523786 -0.036872  0.074939  0.530641
C  1.344452  3.159129 -0.476787  1.948722  1.344452  4.503581
D -1.470935 -0.686175 -0.115709 -0.393146 -1.470935 -2.157110
E -0.330055  0.945098 -0.983779  1.061418 -0.330055  0.615043

In [67]:
dataframe.drop("new", axis=1)

          W         X         Y         Z       sum
A -0.475898  1.169883 -0.056353  0.356876  0.693985
B  0.074939  0.455702  0.523786 -0.036872  0.530641
C  1.344452  3.159129 -0.476787  1.948722  4.503581
D -1.470935 -0.686175 -0.115709 -0.393146 -2.157110
E -0.330055  0.945098 -0.983779  1.061418  0.615043

In [66]:
dataframe

          W         X         Y         Z       new       sum
A -0.475898  1.169883 -0.056353  0.356876 -0.475898  0.693985
B  0.074939  0.455702  0.523786 -0.036872  0.074939  0.530641
C  1.344452  3.159129 -0.476787  1.948722  1.344452  4.503581
D -1.470935 -0.686175 -0.115709 -0.393146 -1.470935 -2.157110
E -0.330055  0.945098 -0.983779  1.061418 -0.330055  0.615043

##### 5. Alterações no dataframe original

In [72]:
dataframe

          W         X         Y         Z       sum
A -0.475898  1.169883 -0.056353  0.356876  0.693985
B  0.074939  0.455702  0.523786 -0.036872  0.530641
C  1.344452  3.159129 -0.476787  1.948722  4.503581
D -1.470935 -0.686175 -0.115709 -0.393146 -2.157110
E -0.330055  0.945098 -0.983779  1.061418  0.615043

In [77]:
dataframe.drop("sum", axis=1, inplace=True)

In [78]:
dataframe

          W         X         Y         Z
A -0.475898  1.169883 -0.056353  0.356876
B  0.074939  0.455702  0.523786 -0.036872
C  1.344452  3.159129 -0.476787  1.948722
D -1.470935 -0.686175 -0.115709 -0.393146
E -0.330055  0.945098 -0.983779  1.061418

### 6. Loc, Iloc e Filtros

### 1. Loc

In [80]:
dataframe

          W         X         Y         Z
A -0.475898  1.169883 -0.056353  0.356876
B  0.074939  0.455702  0.523786 -0.036872
C  1.344452  3.159129 -0.476787  1.948722
D -1.470935 -0.686175 -0.115709 -0.393146
E -0.330055  0.945098 -0.983779  1.061418

In [81]:
dataframe.loc["A"]

W   -0.475898
X    1.169883
Y   -0.056353
Z    0.356876
Name: A, dtype: float64

In [82]:
dataframe.loc[["A"]]

          W         X         Y         Z
A -0.475898  1.169883 -0.056353  0.356876

In [86]:
dataframe.loc[["A", "B"]]

          W         X         Y         Z
A -0.475898  1.169883 -0.056353  0.356876
B  0.074939  0.455702  0.523786 -0.036872

In [94]:
dataframe.loc[["A", "B"],"W"]

A   -0.475898
B    0.074939
Name: W, dtype: float64

In [92]:
dataframe.loc[["A", "B"],["W"]]

          W
A -0.475898
B  0.074939

### 2. Iloc

In [95]:
dataframe.iloc[3, 2]

np.float64(-0.11570852620590696)

In [96]:
dataframe.iloc[0, 0]

np.float64(-0.4758981254095854)

In [97]:
dataframe.iloc[:-1, :]

          W         X         Y         Z
A -0.475898  1.169883 -0.056353  0.356876
B  0.074939  0.455702  0.523786 -0.036872
C  1.344452  3.159129 -0.476787  1.948722
D -1.470935 -0.686175 -0.115709 -0.393146

In [99]:
dataframe.iloc[:-2, 1:]

          X         Y         Z
A  1.169883 -0.056353  0.356876
B  0.455702  0.523786 -0.036872
C  3.159129 -0.476787  1.948722

In [102]:
dataframe.iloc[1:4, 1:3]

          X         Y
B  0.455702  0.523786
C  3.159129 -0.476787
D -0.686175 -0.115709

### 3. Seleção condicional (filtros)

In [108]:
dataframe > 0

       W      X      Y      Z
A   True   True  False  False
B   True  False  False   True
C   True  False  False  False
D  False  False   True   True
E   True   True  False  False

In [113]:
dataframe[dataframe > 0]

          W         X         Y         Z
A  1.984914  1.224551       NaN       NaN
B  1.464035       NaN       NaN  0.089285
C  0.897420       NaN       NaN       NaN
D       NaN       NaN  0.541912  1.045758
E  0.076728  0.420728       NaN       NaN

In [117]:
dataframe

          W         X         Y         Z
A  1.984914  1.224551 -1.909883 -0.451053
B  1.464035 -1.318643 -0.685007  0.089285
C  0.897420 -0.163765 -1.690658 -1.519895
D -2.092707 -0.325972  0.541912  1.045758
E  0.076728  0.420728 -0.467139 -0.795635

In [118]:
dataframe["X"] > 0

A     True
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [121]:
dataframe[(dataframe["W"] > 0) & (dataframe["X"] > 0)]

          W         X         Y         Z
A  1.984914  1.224551 -1.909883 -0.451053
E  0.076728  0.420728 -0.467139 -0.795635